{
    "summon": "--",
    "templateType": "Creature",
    "notes": "Was introduced in the [[Summer Update 2011]]. This animal stands at a distance, although it has no distance attacks. It will melee opponents only if trapped. Use a [[Fist on a Stick]] on the animal to tame it.",
    "isarenaboss": "No",
    "walksthrough": "None.",
    "hp": "45",
    "abilities": "{{Ability List| {{Melee|0-8?}}|{{Ability|distance [[Drunkenness]] attack|rare|element=drunk}} }}",
    "healMod": "100%",
    "paraimmune": "no",
    "holyDmgMod": "100%",
    "maxdmg": "8+?",
    "pushable": "Yes",
    "implemented": "9.10",
    "loot": [
        {
            "amount": "1-2",
            "itemName": "Meat",
            "rarity": "common"
        }
    ],
    "walksaround": "Fire, Energy, Poison",
    "exp": "0",
    "mitigation": "0.15",
    "attacktype": "Distance",
    "article": "a",
    "actualname": "dromedary",
    "illusionable": "Yes",
    "armor": "4",
    "convince": "--",
    "name": "Dromedary",
    "isboss": "No",
    "iceDmgMod": "100%",
    "energyDmgMod": "100%",
    "deathDmgMod": "100%",
    "plural": "dromedaries",
    "hpDrainDmgMod": "100%?",
    "usespells": "no",
    "occurrence": "Common",
    "bestiarytext": "The Dromedary is one of the few Darashian beasts that never played a greater part in the spiritual world. Although, it became important as beast of burden in the people's daily lives. In the earliest days of Ankrahmun, the nomads used Dromedaries to explore the desert. Later it became common to use them in caravans between the settlements. When Drefia was destroyed and Darashia and Ankrahmun ceased most contact due to their philosophical differences, the Dromedary breeding came to a sudden halt. Many Dromedaries were released to freedom, only to perish by the predators of the desert. Some of them survived though and revitalised the free roaming Dromedary population. For a while Dromedaries played almost no role in the settlements of Darashia, until recently, foreign adventurers rediscovered the Dromedary as mount. Dromedaries are somewhat hostile towards mankind though and are not easy captured and tamed. The biting, kicking and spitting involved in the taming makes the process somewhat tedious. Of course, it also does not help that the Dromedary itself does not behave any better than that as well. In the end, you end up with a very stoical mount, although it is rarely frightened at all. This, however, makes it somewhat difficult to induce the Dromedary to a higher speed.",
    "speed": "57",
    "pushobjects": "No",
    "fireDmgMod": "100%",
    "sounds": [
        "Snort",
        "Grunt!"
    ],
    "bestiaryclass": "Mammal",
    "creatureclass": "Mammals",
    "earthDmgMod": "100%",
    "physicalDmgMod": "100%",
    "primarytype": "Ungulates",
    "race_id": "733",
    "bestiarylevel": "Trivial",
    "senseinvis": "no",
    "drownDmgMod": "100%?",
    "bestiaryname": "dromedary",
    "behaviour": "It will always stay about five tiles away from you, even if it is [[Fiendish and Influenced Creatures|influenced]].",
    "location": "[[Ankrahmun]] near the way to Darashia, [[Ankrahmun]] near sea, around [[Darashia]], [[Issavi]].",
    "strategy": "They are weak creatures, just attack them."
}