{
    "summon": "3000",
    "templateType": "Creature",
    "plural": "druid familiars",
    "hpDrainDmgMod": "100%?",
    "notes": "When you look at a summoned Druid Familiar, you will see the summoner's character name and how long it will take for the summon to disappear.​ It can be summoned by [[Druid]]s of level 200 or higher, by saying the magic words: ''Utevo gran res dru'' ([[Summon Druid Familiar]]). All the experience that is expected to be 'gained' by the summon goes to the player. So there is no shared exp between the summon and its summoner, like with the normal [[Summon Creature]] spell.\n\nIt will follow players at their speed and will go up and down stairs and holes with them. It lasts for 15 minutes with a 30 minutes cooldown. It can go with you to a protection zone. If you logout, it will disappear stopping the countdown of its timer, and will reappear when you login again.",
    "walksthrough": "?",
    "hp": "20000",
    "speed": "?",
    "abilities": "{{Ability List|{{Melee|0-300?}}|{{Ability|Root Missile|230-260?|earth}}|{{Ability|Earth Beam (2 sqm)|90-150?|earth}}|{{Healing|range=600}}|{{Ability|Challenge|2 sqm wide|}}}}",
    "pushobjects": "?",
    "healMod": "100%?",
    "paraimmune": "?",
    "fireDmgMod": "100%?",
    "holyDmgMod": "100%?",
    "sounds": [
        ""
    ],
    "maxdmg": "{{Max Damage|physical=300?|earth=410}}",
    "pushable": "?",
    "implemented": "11.40.5409",
    "loot": [],
    "walksaround": "?",
    "exp": "?",
    "creatureclass": "Elementals",
    "earthDmgMod": "100%?",
    "physicalDmgMod": "100%?",
    "primarytype": "Bio-Elementals",
    "spawntype": [
        "Triggered"
    ],
    "history": "From their release until the [[Winter Update 2020]], there was only one type of [[Familiar]] for each vocation, and the Druid Familiar was simply called [[Grovebeast]].",
    "senseinvis": "?",
    "actualname": "druid familiar",
    "article": "a",
    "illusionable": "no",
    "armor": "?",
    "drownDmgMod": "100%?",
    "convince": "--",
    "name": "Druid Familiar",
    "isboss": "no",
    "behaviour": "Attacks the player target from melee distance casting challenge and self-healing very often.",
    "location": "Following its master.",
    "iceDmgMod": "100%?",
    "strategy": "The Druid Familiar can be very useful for low level Druids as a free blocker and damage boost. Due to its timer/cooldown mechanic, you cannot have 100% uptime of it, so it's important to beware when it's about to disappear as all creatures will change target. Since it's main function is to act like a blocker, it's not recommended to use it when hunting with a Knight as it will Challenge the creatures away from him, reducing the knight's damage output. \n\nLearning how to manage the summon can be tricky at first, as you cannot force it to cast its challenge spell. You should be prepared to block the creatures you're going to fight for a few turns until the Druid Familiar challenges them, since its spell use is quite erratic. Similarly, it's possible that it doesn't use the spell for a few seconds, allowing the creatures to retarget. An important strategy when using the Druid Familiar to block several creatures is to always change your target to the creature that will die last, because if the Druid Familiar doesn't have a target it will run back to its master, bringing the creatures its blocking with it. \n\nAt higher levels, the Druid Familiar is used mostly in emergencies to Challenge creatures that are trapping another player or yourself. This however isn't always effective as the summon dies very quickly to strong creatures and may not even use the Challenge spell before that.",
    "energyDmgMod": "100%?",
    "deathDmgMod": "100%?"
}