{
    "summon": "--",
    "templateType": "Creature",
    "hpDrainDmgMod": "100%?",
    "notes": "It's one of the Usurper leaders trying to take control of the [[Order of the Lion]]. \n{{JSpoiler|Part of [[The Order of the Lion Quest]].}}",
    "walksthrough": "?",
    "hp": "32000",
    "speed": "?",
    "abilities": "{{Ability List| {{Melee|0-1444+}}|{{Ability|[[Ice]]|0-1500+|element=ice}}|{{Ability|[[Death]]|0-800+|element=death}} }}",
    "pushobjects": "?",
    "healMod": "100%?",
    "paraimmune": "?",
    "fireDmgMod": "100%?",
    "holyDmgMod": "100%?",
    "sounds": [
        "Who are you? Well too bad, you weren't our target!",
        "You don't deserve this!",
        "Kesar does not belong here!"
    ],
    "maxdmg": "?",
    "pushable": "?",
    "runsat": "0",
    "implemented": "12.40.9997",
    "loot": [],
    "walksaround": "?",
    "exp": "23000",
    "creatureclass": "Humans",
    "earthDmgMod": "100%?",
    "physicalDmgMod": "100%?",
    "primarytype": "Members of the Order of the Lion",
    "spawntype": [
        "Triggered"
    ],
    "race_id": "1958",
    "history": "Approximately a week after Fugue was launched as part of the Summer Update 2020 it became common knowledge that his spawning mechanic could be used to farm his loot. By forcing his spawn several times, without completing the quest, players could kill an indefinite amount of Fugues, which dropped good loot in a [[Reward Container]], including parts of the [[Lion Set]]. On {{OfficialNewsArchive|5655|July 19, 2020}}, CipSoft made an emergency downtime and removed Fugue's loot. \n\nOn the following week, it was {{OfficialNewsArchive|5662|announced}} that players who excessively farmed this mechanic would be punished. This punishment consisted of an immediate two days of [[Banishment]] for destructive behavior, as well as being unable to log in for three days during the upcoming [[Double Loot Events|Double Loot Event]]. In total, over 1500 accounts were punished for this, according to CipSoft. Nevertheless, no items, gold or Tibia Coins were removed from the characters, which were allowed to keep the loot obtained. \n\nFinally, on {{Post|39019573|August 21, 2020}}, CipSoft confirmed that the loot removal would be permanent.",
    "senseinvis": "yes",
    "actualname": "Fugue",
    "illusionable": "no",
    "armor": "?",
    "drownDmgMod": "100%?",
    "convince": "--",
    "name": "Fugue",
    "isboss": "yes",
    "behaviour": "Fights in close combat.",
    "location": "[[Bounac]] throne room.",
    "iceDmgMod": "100%?",
    "strategy": "Fugue is similar in strength to [[Grand Master Oberon]], though its many summons can make the fight more dangerous. For a small team or even a duo with a blocker and healer it isn't very complicated and should be rather straightforward damage dealing. \n\nWithout a blocker, or at lower levels (<400), a good strategy is to pull Fugue outside of the room and close the door, protecting yourself from the Usurpers. After that, you can also use the stairs to go down in case of an emergency or to heal your [[Special Summons|Special Summon]], if using it. \n\nBear in mind that Fugue disappears if it's not killed a few minutes after it spawns, which can hinder the solo strategy with stair-hopping ineffective.",
    "energyDmgMod": "100%?",
    "deathDmgMod": "100%?"
}