{
    "summon": "--",
    "templateType": "Creature",
    "notes": "It can be [[Gryphon (Mount)|tamed]] by using [[The Regalia of Suon]] on it while wearing a [[Gryphon Mask]].",
    "walksthrough": "?",
    "hp": "3200",
    "abilities": "{{Ability List| {{Melee|?}} }}",
    "healMod": "100%",
    "paraimmune": "yes",
    "holyDmgMod": "100%",
    "pushable": "?",
    "implemented": "12.20.8834",
    "loot": [],
    "walksaround": "?",
    "exp": "1000",
    "mitigation": "2.19",
    "attacktype": "Melee",
    "article": "a",
    "actualname": "gryphon",
    "illusionable": "no",
    "armor": "76",
    "convince": "--",
    "name": "Gryphon",
    "isboss": "no",
    "iceDmgMod": "100%",
    "energyDmgMod": "100%",
    "deathDmgMod": "100%",
    "plural": "gryphons",
    "hpDrainDmgMod": "100%?",
    "usespells": "yes",
    "occurrence": "Uncommon",
    "bestiarytext": "Gryphons are hybrid creatures, part lion and part bird of prey. They have the body, tail and back legs of a lion but the forelegs, head and wings of an eagle. <br/>It is said that the entire continent was once given to them by the gods. But the Anuma conferred the dominance over Kilmaresh to the humans, in an effort to let them take responsibility of their own. However, after the religious war between the worshippers of Suon and Fafnar and the cataclysm that severed the continent, the Anuma took the reign over Kilmaresh back - for the humans' own benefit as they said. It is said that out of all Anuma, the sun god Suon loved the gryphons most whereas his wild sister Fafnar favoured the manticores. <br/>Gryphons mate for life and if either partner dies, the other will continue the rest of its life alone and never search for a new mate. They live very reclusive and love the high mountain peaks of Kilmaresh. In very rare cases, a gryphon will forge a bond with a human it regards worthy. If this happens, the gryphon will agree to carry the mortal on its back which is considered the highest possible honour by the people of Kilmaresh. <br/>As gryphons are Suon's holy animals, the inhabitants of Kilmaresh decorate the sun god's temples with gilded gryphon eggs. To get the rare egg shells, chosen members of a temple will undertake a pilgrimage to the gryphon nests high in the Kilmaresh mountains. If they find a pair that recently hatched fledglings, they will offer presents to the parents and ask for the leftover egg shells. Mostly the gryphons benevolently agree and gift their now empty eggs to the human priests. The mortals will bring the egg shells to the respective temple, where the eggs are blessed, gilded on the inside and filled with onyx sand. Mostly they are used to hold incense sticks that are burned in the temples or gravesides.",
    "speed": "160",
    "pushobjects": "?",
    "fireDmgMod": "100%",
    "sounds": [],
    "runsat": "0",
    "bestiaryclass": "Magical",
    "creatureclass": "Misc",
    "earthDmgMod": "100%",
    "physicalDmgMod": "100%",
    "primarytype": "Anuma",
    "spawntype": [
        "Regular"
    ],
    "race_id": "1819",
    "bestiarylevel": "Medium",
    "senseinvis": "yes",
    "drownDmgMod": "100%?",
    "bestiaryname": "gryphon",
    "location": "[[Kilmaresh Mountains]]",
    "strategy": "This creature is not found in amounts good enough for hunting, so it's only of interest for those who wish to tame it."
}