{
    "summon": "420",
    "templateType": "Creature",
    "notes": "Huskies are used for sled transportation in [[Svargrond]].<br />\n'''Note:''' For every killed husky you will have to pay 500 [[gp]] fee to [[Iskan]]. In case you refuse to pay it, [[Sven]] will charge you 1500 [[gp]] for each husky you killed.",
    "walksthrough": "None",
    "hp": "140",
    "abilities": "{{Ability List|None}}",
    "healMod": "100%",
    "paraimmune": "no",
    "holyDmgMod": "100%",
    "maxdmg": "0",
    "pushable": "?",
    "implemented": "8.00",
    "loot": [],
    "walksaround": "Fire, Energy, Poison",
    "exp": "0",
    "mitigation": "0.13",
    "attacktype": "None",
    "article": "a",
    "actualname": "husky",
    "illusionable": "yes",
    "armor": "1",
    "convince": "420",
    "name": "Husky",
    "isboss": "no",
    "iceDmgMod": "100%",
    "energyDmgMod": "100%",
    "deathDmgMod": "100%",
    "plural": "huskies",
    "hpDrainDmgMod": "100%?",
    "usespells": "no",
    "occurrence": "Uncommon",
    "bestiarytext": "The Husky is a northern breed of dog that has well adapted to the harsh climate of the icy areas in Tibia. As a faithful hunting companion as well as a draught animal for the dog sleds, the Husky has become a vital part of the life in the North. Huskies are a prized possession and the Husky breeders are eminently respectable. The best of those dogs are nearly invaluable to their masters and even the chance to use a dog sled now and then is seen as great sign of trust and a great honour. Playful and curious, Huskies roam the streets and camps of the northmen, some are even trained as watchdogs. Huskies are almost exclusively encountered in the company of men and it's doubtful if they were able to survive on their own.",
    "speed": "132",
    "pushobjects": "?",
    "fireDmgMod": "100%",
    "sounds": [
        "Yoooohuuuu!",
        "Grrrrrrr",
        "Ruff, ruff!"
    ],
    "runsat": "100",
    "bestiaryclass": "Mammal",
    "creatureclass": "Mammals",
    "earthDmgMod": "100%",
    "physicalDmgMod": "100%",
    "primarytype": "Canines",
    "race_id": "325",
    "bestiarylevel": "Harmless",
    "senseinvis": "no",
    "drownDmgMod": "100%?",
    "bestiaryname": "husky",
    "behaviour": "Similar to [[dog]]s, huskies are not aggressive; they are fast and will follow you as if you were a piece of meat.",
    "location": "[[Svargrond]] and [[Nibelor]].",
    "strategy": "Because they are extremely annoying, people have come up with strategies to get rid of them here are some options that can suit any type of player.<br />\n'''The friendly way''': You can run through the depot or enter in a shop and close the door or use a [[Stealth Ring]] for a few seconds also using parcels and trapping them in a corner is a more lasting choice.<br />\n'''The unfriendly way''': Simple hit them with your fist once or twice, trying not to kill them because of the negative consequences, but enough so that they run away.<br />\n'''The noob way''': If you hate them, using a [[Trap]] to kill them is a good way to get rid of them. This won't count as a kill from you and you don't have to pay the fee each time you kill one."
}