{
    "summon": "--",
    "templateType": "Creature",
    "notes": "Not only these creatures are immune to [[Fire]], they actually get healed by it.",
    "walksthrough": "Fire",
    "hp": "5900",
    "abilities": "{{Ability List| {{Melee}}|{{Ability|[[Fire Attacks]]|element=fire}} }}",
    "healMod": "100%",
    "paraimmune": "no",
    "holyDmgMod": "100%",
    "maxdmg": "530",
    "pushable": "no",
    "implemented": "11.50.6055",
    "loot": [
        {
            "amount": "1-2",
            "itemName": "Small Enchanted Ruby",
            "rarity": "uncommon"
        }
    ],
    "walksaround": "Energy, Poison",
    "exp": "4000",
    "mitigation": "2.16",
    "attacktype": "Melee",
    "history": "On {{OfficialNewsArchive|4592|April 18, 2018}}, in order to increase its strength, its HP was increased from 5000 to 5900 and the armor to 82.",
    "article": "a",
    "actualname": "lava lurker",
    "illusionable": "no",
    "armor": "82",
    "convince": "--",
    "name": "Lava Lurker",
    "isboss": "no",
    "iceDmgMod": "100%",
    "energyDmgMod": "100%",
    "deathDmgMod": "100%",
    "plural": "lava lurkers",
    "hpDrainDmgMod": "100%",
    "usespells": "yes",
    "lightcolor": "192",
    "occurrence": "Common",
    "bestiarytext": "The lava lurker seems like a creature just created for mayhem and destruction. It's a creature that seems to be in a constant, highly agitated frenzy, hell-bent on hurting, destroying and devouring. Though arguably more an elemental then a creature the lurker is mostly encountered close to volcanic activity, some even claim to be born or created by it. Despite it's aggressive nature it can become dormant for an unknown time and even blend it with other lave or magma environment being perfectly camouflaged. It's unknown it's actively lurks for prey in this state or becomes somehow awake as soon as a potential victim comes close but the outcome is the same. The lava lurker coms into action and viciously attacks every potential victim like the raging fire that might have given birth to it. With no obvious organs it is unknown how lukers feed. Due to their eagerness to burn and sear thing, it's assumed that ashes of organic matter gives then some sort of sustenance. Though it's theorized that the lurker reproduces like the common slime, this is only wild speculation and not backed up by any evidence at all. The whole comparisons to slimes might be highly misleading and create more questions than it provides answers.<br />\nHow exactly they fit into the rooster of those bellow is also highly speculative. Some evidence suggest that their appearance might only be a side effect of the heat that comes with the advance of the hordes from bellow. Yet they mostly show no aggression towards the forces of those bellow, they are rarely part of attacks on outposts and when they do, it's almost more as if they are some force of nature then part of an army.<br />\nThis puts their whole sentience into question. Scientists and sorcerers that are fascinated by this creature but are just on the brink of their studies of the lava lurker. Only time will tell what valuable lessons can be made by their analysis. Given the destructive nature of the lava lurker though, a steep price might have to be paid in that process.",
    "speed": "58",
    "pushobjects": "Yes",
    "fireDmgMod": "-100%",
    "sounds": [],
    "lightradius": "5",
    "bestiaryclass": "Elemental",
    "creatureclass": "Elementals",
    "earthDmgMod": "100%",
    "physicalDmgMod": "100%",
    "primarytype": "Blobs",
    "spawntype": [
        "Regular",
        "Unblockable"
    ],
    "race_id": "1563",
    "bestiarylevel": "Hard",
    "senseinvis": "yes",
    "drownDmgMod": "100%",
    "bestiaryname": "lavablob",
    "location": "[[Gnome Deep Hub]]",
    "strategy": "Hunting these creatures should be avoided since they have a lot of health and only drop one cheap item. If you decide to do so, avoid getting swarmed and try to keep your distance (unless you are a knight, of course) since they are very slow."
}