{
    "summon": "--",
    "templateType": "Creature",
    "notes": "Added in the [[Updates/8.4|Christmas Update 2008]].",
    "walksthrough": "None",
    "hp": "150",
    "abilities": "{{Ability List|{{Melee|0-75}}|{{Ability|Magic Missile|10-30|energy}}|{{Healing}}|{{Ability|makes you [[drunk]]}}|{{Summon|Mercury Blob|3}}}}",
    "healMod": "100%",
    "paraimmune": "no",
    "holyDmgMod": "35%",
    "maxdmg": "{{Max Damage|physical=75|energy=30|summons=315}}",
    "pushable": "no",
    "implemented": "8.40",
    "loot": [
        {
            "itemName": "Glob of Mercury",
            "rarity": "uncommon"
        }
    ],
    "walksaround": "Fire, Energy, Poison",
    "exp": "180",
    "mitigation": "0.25",
    "attacktype": "Melee",
    "article": "a",
    "actualname": "mercury blob",
    "illusionable": "no",
    "armor": "3",
    "convince": "--",
    "name": "Mercury Blob",
    "isboss": "no",
    "iceDmgMod": "85%",
    "energyDmgMod": "100%",
    "deathDmgMod": "0%",
    "plural": "mercury blobs",
    "hpDrainDmgMod": "20%",
    "usespells": "yes",
    "occurrence": "Common",
    "bestiarytext": "This silver fluid is actually some sort of residue of magical experiments involving teleporting and travelling to other dimensions. Actually, they are part of the usually unseen membrane that separates different states of existence such as dimensions, spheres and worlds. Sometimes, while something is passing from one state of existence to another, parts of the membrane are spilled into one of the worlds involved. Even if it is hard to believe, this residue seems to own some sort of intelligence or at least some instinct. However, it is also possible that a Mercury Blob has an incredibly high intellect which has a concept that we simply cannot grasp.<br />Though the residue interacts with objects and people in our world, there seems no true purpose in its actions. Whenever it meets a human being it seems to start an attack; however, no malice can be attributed to this behaviour. It is doubtful whether the residue is aware of the harm it causes or the concept of harm at all. Maybe the attacks are a form of communication attempts. Sadly, these attempts are often lethal for mortals, and so it is strongly advised to fight back with all means.<br />Its ability to produce a copy of itself might be another attempt to interact with our world.  As far as we can tell, killing a Mercury Blob results in cutting its connection to our world and letting it return into the membrane, its natural habitat.",
    "speed": "75",
    "pushobjects": "yes",
    "fireDmgMod": "90%",
    "sounds": [
        "Crackle"
    ],
    "bestiaryclass": "Slime",
    "creatureclass": "Elementals",
    "earthDmgMod": "35%",
    "physicalDmgMod": "90%",
    "primarytype": "Blobs",
    "race_id": "515",
    "bestiarylevel": "Easy",
    "senseinvis": "no",
    "drownDmgMod": "100%?",
    "bestiaryname": "mercuryblob",
    "behaviour": "Like a [[Slime]], will advance towards its prey in attempt to overwhelm it by [[summon]]ing more Mercury Blobs.",
    "location": "[[Alchemist Quarter]].",
    "strategy": "Kill it like a [[Slime]], being wary of geting surrounded by its [[Summon]]s. Don't try to run around this monster, because when it makes you [[Drunk]], you will be unable to escape."
}