{
    "summon": "--",
    "templateType": "Creature",
    "hpDrainDmgMod": "100%?",
    "notes": "The first time you deal damage to this creature it will transform into one of the four following apparitions: [[Druid's Apparition]], [[Knight's Apparition]], [[Paladin's Apparition]] or [[Sorcerer's Apparition]]. It is most likely that it will transform into your vocation's apparition.\n\nAlthought it is possible to deal damage to Mirror Images (i.e attacking exclusively with [[Familiars]]), it is likely to be impossible to kill one without forcing a transformation into a vocation apparition as they never go under 1 [[Hit Point|hit point]].",
    "walksthrough": "Fire, Energy, Poison",
    "hp": "35000",
    "bestiarytext": "The mirror images are beyond any classification yet. They don't register to divination magic at all and defy any mundane attempts to examine them more closely. A calculated malice seems to guide them all and their evil intentions are too obvious to be dismissed as random actions. Their malleable forms are elusive and unstable, so guided by their inherent evil, they choose another form to confront their victims. Legends of Zarganash tell about a time when the mirror images walked the realm like gods and took the shape of whatever their intended victims most desired or feared most. At some point in the distant past, however, something happened. Be it a shift in the flows of power, the intervention of one of Zarganashs most powerful denizens or something else completely, no one can tell. Whatever the cause has been, the powers of the mirror images were greatly diminished. Still cruel and dangerous they were only a mere shadow of their glorious past and their shifting powers only included a far lesser array of horrible shapes. Some obscure texts seem to claim that the mirrored images can be summoned through blasphemous rituals, even into the mortal realm. Such rituals should be able to force the image into certain forms of manifestation, chosen by the summoner. Such claims are lacking verification yet and the fact that other denizen of Zarganash are bound to the realm in their core it seems somewhat unlikely that such rituals exist or could be easily and reliably performed at all. In Zarganash itself the mirror image it's power level is nowhere as near to the legends of their past. Still they are dangerous opponents that use their shape changing powers to at least some extent to gain an advantage. It is said that no one ever saw the true form of a mirror image and even that they are somehow locked out of their true form since their downfall. While mirror images have perished their overall number seems not to be affected by this. This leads to the assumption that for all their enigmatic qualities they are somehow also bound to the damning circle of destruction and recreation that has many denizens of Zarganash in its grip.",
    "abilities": "{{Ability List|}}",
    "pushobjects": "yes",
    "healMod": "100%?",
    "paraimmune": "yes",
    "fireDmgMod": "101%>?",
    "holyDmgMod": "99%<?",
    "sounds": [
        "Delusional!",
        "I'll be your worst nightmare",
        "The mirrors can't contain the night.",
        "What a lovely reflection."
    ],
    "maxdmg": "?",
    "pushable": "no",
    "implemented": "12.40.9997",
    "loot": [],
    "walksaround": "None",
    "exp": "27000",
    "creatureclass": "The Undead",
    "earthDmgMod": "100%",
    "physicalDmgMod": "99%<?",
    "primarytype": "Undead Humanoids",
    "spawntype": [
        "Regular"
    ],
    "history": "It didn't walk over Fire Fields until [[Updates/12.64.10672|March 09, 2021]], when this behavior was changed.\n\nOn [[Updates/12.81.11476|December 14, 2021]] influenced Mirror Images were fixed to not lose their influenced status when turning into an apparation.",
    "senseinvis": "yes",
    "article": "a",
    "actualname": "mirror image",
    "illusionable": "no",
    "drownDmgMod": "100%?",
    "convince": "--",
    "bestiaryname": "mirrorimage",
    "name": "Mirror Image",
    "isboss": "no",
    "behaviour": "Attacks from distance ranged until it transforms into an apparition.",
    "location": "[[The Mirrored Nightmare]].",
    "iceDmgMod": "99%<?",
    "strategy": "Knights can take advantage of them being ranged and use [[Chivalrous Challenge]] on them before they transform into an apparition. Furthermore, if there are too many creatures around, you can avoid hitting the Mirror Images so they stay ranged while attacking the blocker.",
    "energyDmgMod": "100%",
    "deathDmgMod": "101%>?"
}