{
    "summon": "?",
    "templateType": "Creature",
    "plural": "werecrocodiles",
    "hpDrainDmgMod": "100%?",
    "notes": "<gallery captionalign=\"center\" mode=\"nolines\">Werecrocodile Artwork.jpg|Official [[Creature Artwork]]</gallery>",
    "walksthrough": "None",
    "hp": "5280",
    "bestiarytext": "Werecrocodiles are humans under a curse - others claim infected with a disease - that causes them to transform into savage beasts. At the beginning, the transformation only takes place at full moon, and the victim regains its human appearance the next morning. In the course of time, the transformation lasts longer and the full moon is no longer a necessary condition for the transformation. At a certain point, the beast takes over more and more often.\nWerecrocodiles are strong and bulky, yet a bit clumsy and not very quick on land. They are dangerous predators nonetheless and their appearance is a mix between a crocodile and a human being. Like crocodiles, Werecrocodiles favour warm and humid areas such as jungles with larger bodies of water as homesteads. They behave very aggressively towards intruders.\n\nThe curse of the Full Moon, as it is frequently called, is usually spread by the infectious bite or scratch of other were-creatures. Forbidden books also tell about methods that allow to turn somebody into a were-creature with the help of dark rites. Some twisted individuals even call the curse upon themselves in the hope of using their new powers to avenge an injustice or insult.",
    "occurrence": "Common",
    "speed": "115",
    "abilities": "{{Ability List}}",
    "healMod": "100%?",
    "paraimmune": "?",
    "fireDmgMod": "100%?",
    "holyDmgMod": "100%?",
    "sounds": [
        ""
    ],
    "maxdmg": "0",
    "implemented": "13.20",
    "bestiaryclass": "Lycanthrope",
    "loot": [],
    "exp": "3900",
    "creatureclass": "Lycanthropes",
    "earthDmgMod": "100%?",
    "mitigation": "2.28",
    "physicalDmgMod": "100%?",
    "race_id": "2388",
    "bestiarylevel": "Hard",
    "senseinvis": "?",
    "article": "a",
    "actualname": "werecrocodile",
    "armor": "82",
    "drownDmgMod": "100%?",
    "convince": "?",
    "bestiaryname": "werecrocodile",
    "name": "Werecrocodile",
    "isboss": "no",
    "iceDmgMod": "100%?",
    "energyDmgMod": "100%?",
    "deathDmgMod": "100%?"
}